const words = [

"دار",
"زنقة",
"حانوت",
"قهوة",
"أتاي",
"خبز",
"طاجين",
"كسكس",
"حريرة",
"مسمن",

"طوموبيل",
"طاكسي",
"طوبيس",
"مطار",
"قنطرة",
"بحر",
"جبل",
"واد",
"شمس",
"قمر",

"ديسكورد",
"بيسي",
"كيبورد",
"ماوس",
"بلايستيشن",
"مانيط",
"سيرفر",
"بوت",
"شات",
"لعبة",

"كورة",
"هدف",
"حكم",
"لاعب",
"مدرب",
"ملعب",
"جمهور",
"فريق",
"صافرة",
"تشامبيون",

"قط",
"كلب",
"حصان",
"حوت",
"طير",
"أسد",
"فيل",
"قرد",
"نحلة",
"فراشة",

"كتاب",
"قلم",
"مدرسة",
"أستاذ",
"تلميذ",
"مكتب",
"كرسي",
"سبورة",
"ورقة",
"حقيبة"

];


function getRandomWords(amount){

    let copy = [...words];

    let result = [];

    while(result.length < amount){

        let index = Math.floor(Math.random()*copy.length);

        result.push(copy[index]);

        copy.splice(index,1);

    }

    return result;

}
